app/controllers/posts_controller.rb

def update
  @post = Post.find(params[:id])

  if @post.update(params[:post].permit(:title, :text))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = 21  [["text", "goodboy and best"], ["updated_at", Wed, 11 Sep 2013 14:33:06 UTC +00:00]]

def destroy
  @post = Post.find(params[:id])
  @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]

def create
 	 @post = Post.new(params[:post].permit(:title, :text))

 	  if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 10 Sep 2013 20:16:25 UTC +00:00], ["text", "goood"], ["title", "shiva"], ["updated_at", Tue, 10 Sep 2013 20:16:25 UTC +00:00]]